//
// Created by sasha on 13.03.2024.
//Написать программу, в которой инициализируется функция int main().
// Организовать в данной функции раздельный вывод двух строк на консоль
// с произвольным содержимым (при помощи управляющей конструкции ‘\n’).

#include <iostream>

int main() {
    std::cout << "First line!" << '\n';
    std::cout << "Second line!" << '\n';
}